{
    "title": "Staffing Services",
    "sliderData": [
        {
            "title": "Why CrackIT?",
            "content": "Our technological support enriches your experience and judgment to come out as the most sought after professional.Our focus on quality customer service is mirrored within all levels of the organization, this is one differentiator between CrackIT and others. We look for an enduring cooperation and partnerships with our professionals as we can visualize potential to be our prospective clients with their own startups soon.It is one of our promises to ensure comparatively low overheads to increase our accessibility to our clients"
        },
        {
            "title": "What do we gaurenty?",
            "content": "With years of experience in Staffing firm, we assure you get the quality and exceptional talent. We would also assist you to swap the candidate in case of mishaps. You can rely on us for long-lasting, top-notch resources"
        },
        {
            "title": "Finding a new Job?",
            "content": "Searching for a new job? Want to start an exciting career, you are at the right place. CrackIt collaborates with the top clients across Canada and you might land at your dream job in no time. So what are you waiting for? Contact us to know the available jobs"
        },
        {
            "title": "Training & Assistance",
            "content": "We would also like to extend our hand in getting you ready for the interview. Our technical panel would mentor you and help you to clear all your doubts regarding the interview. we also assist you by making your resume market ready."
        }
    ],
    "serviceContent": [
        {
            "content": "CrackIT offers the most reliable IT outsourcing services with specialization in Staffing Solutions. Our pricing model is flexible, this makes our clients to collaborate with us in no time."
        },
        {
            "content": "We offer world-class staffing on a temporary, temporary-to-hire, and direct-hire basis. With years of experience serving clients around the Canada, CrackIT hand picks the right candidates who would assist to ace your targets . "
        },
        {
            "content": "We not only hire the right people for you but also make sure that the resorces are updated with the ever growing technical skills. We’ll also continue to meet the evolving challenges of workforce flexibility with staffing solutions tailored to your precise business needs."
        },
        {
            "content": "Want to know more about the pricing model? Contact us."
        }
    ]
}